code/cluster/published/current/raw/2026-03-05_localhost_modern_profile_r24_full20b_localhost_vllm_serve_sweep/repeat_3/sweep_log.txt
Lowering --gpu-memory-utilization from 0.8 to 0.8000 based on free VRAM (182514 MiB / 183359 MiB).
Skipping completed concurrency point 32 (resume).
Skipping completed concurrency point 64 (resume).
Skipping completed concurrency point 128 (resume).
Skipping completed concurrency point 256 (resume).
=== Starting vLLM Server ===
Enabling --enforce-eager for startup robustness.
Server PID: 27
Server log: /results/server.log
Waiting for server to be ready...
  Waiting... (5s)
  Waiting... (10s)
  Waiting... (15s)
  Waiting... (20s)
  Waiting... (25s)
  Waiting... (30s)
  Waiting... (35s)
  Waiting... (40s)
  Waiting... (45s)
  Waiting... (50s)
  Waiting... (55s)
  Waiting... (60s)
  Waiting... (65s)
Server is ready!


========================================
=== Running Benchmark: Concurrency 512 ===
========================================
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7a35d8145e40>, trust_remote_code=False, seed=0, num_prompts=5120, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='vllm', base_url='http://localhost:8888', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=512, model='openai/gpt-oss-20b', input_len=1024, output_len=1024, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='/results', result_filename='conc512_isl1024_osl1024_tp1.json', ignore_eos=False, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-229730de-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None, skip_tokenizer_init=False, insecure=False)
INFO 03-05 03:37:00 [datasets.py:626] Sampling input_len from [1024, 1024] and output_len from [1024, 1024]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 512
100%|██████████| 5120/5120 [08:08<00:00, 10.48it/s] 
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     5120      
Failed requests:                         0         
Maximum request concurrency:             512       
Benchmark duration (s):                  488.69    
Total input tokens:                      5242880   
Total generated tokens:                  5242880   
Request throughput (req/s):              10.48     
Output token throughput (tok/s):         10728.40  
Peak output token throughput (tok/s):    12544.00  
Peak concurrent requests:                640.00    
Total token throughput (tok/s):          21456.80  
---------------Time to First Token----------------
Mean TTFT (ms):                          607.96    
Median TTFT (ms):                        396.36    
P99 TTFT (ms):                           4462.11   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          47.02     
Median TPOT (ms):                        46.42     
P99 TPOT (ms):                           50.60     
---------------Inter-token Latency----------------
Mean ITL (ms):                           47.02     
Median ITL (ms):                         44.94     
P99 ITL (ms):                            82.28     
==================================================

Results saved to:
  - /results/conc512_isl1024_osl1024_tp1.json
  - /results/conc512_bench.txt
  - /results/conc512_telemetry.csv

========================================
=== Sweep Complete ===
========================================
========================================
vLLM Concurrency Sweep Results
========================================
Model: openai/gpt-oss-20b
TP: 1
ISL: 1024, OSL: 1024

Concurrency | Output tok/s | Total tok/s | Mean TTFT | Mean TPOT | P99 TPOT
------------|--------------|-------------|-----------|-----------|----------
32          | 769.46       | 1538.91     | 178.36    | 41.438    | 42.588   
64          | 1542.00      | 3083.99     | 224.36    | 41.305    | 41.979   
128         | 2920.49      | 5840.97     | 285.48    | 43.555    | 44.318   
256         | 6153.08      | 12306.16    | 367.04    | 41.212    | 41.970   
512         | 10728.40     | 21456.79    | 607.96    | 47.017    | 50.598